enchant();

var Q=[
"1.下の句は？<br>秋の田のかりほの庵の苫をあらみ ,わが衣手に雪は降りつつ,わが衣手は露にぬれつつ,わが身ひとつの秋には.. ,1,",//1
"2.下の句は？<br>春過ぎて夏来にけらし白妙の,ふるさと寒く衣打つなり ,衣かたしきひとりかも寝む,衣干すてふ天の香具山,2",//2
"3.下の句は？<br>あしびきの山鳥の尾のしだり尾の,ながながし夜をひとりか..,衣かたしきひとりかも..,世を思ふゆゑにもの思ふ..,0",//3
"4.下の句は？<br>田子の浦にうち出でて見れば白妙の,吉野の里に降れる白雪 ,富士の高嶺に雪は降りつつ,わが衣手に雪は降りつつ,1",//4
"5.下の句は？<br>奥山に紅葉踏み分け鳴く鹿の,名こそ流れてなほ聞こえけれ,かひなく立たむ名こそをしけれ,声聞く時ぞ秋は悲しき,2",//5
"6.下の句は？<br>鵲の渡せる橋に置く霜の,あらはれわたる瀬々の網代木,白きを見れば夜ぞ更けにける,つらぬきとめぬ玉ぞ散りける,1",//6
"7.下の句は？<br>天の原ふりさけ見れば春日なる,三笠の山に出でし月かも,有明の月を待ち出でつるかな,雲のいずこに月宿るらむ ,0",//7
"8.下の句は？<br>わが庵は都の辰巳しかぞ住む,世をうぢ山と人はいふなり,紅葉の錦神のまにまに,逢はでこの世を過ぐしてよとや,0",//8
"9.下の句は？<br>花の色は移りにけりないたづらに,わが身ひとつの秋にはあらねど,ふりゆくものはわが身なりけり,わが身世にふるながめせしまに,2",//9
"10.この句の作者は？<br>奥山に紅葉踏みわけ鳴く鹿の声きく時ぞ秋は悲しき,猿丸大夫,菅家,源宗于朝臣,0",
"11.下の句は？<br>これやこの行くも帰るも別れては,乙女の姿しばしとどめむ,知るも知らぬもあふ坂の関,恋ぞ積もりて淵となりぬる,1",//10
"12.下の句は？<br>わたの原八十島かけて漕ぎ出でぬと,人には告げよ海人の釣船,海人の小舟の綱手かなしも,焼くや藻塩の身もこがれつつ,0",//11
"13.下の句は？<br>天つ風雲の通ひ路吹きとぢよ,花ぞ昔の香に匂ひける,よに逢坂の関は許さじ,乙女の姿しばしとどめむ,2",//12
"14.下の句は？<br>筑波嶺の峰より落つるみなの川,あまりてなどか人の恋しき,恋ぞ積もりて淵となりぬる,恋に朽ちなむ名こそ惜しけれ,1",//13
"15.下の句は？<br>陸奥のしのぶもぢずりたれゆえに,乱れそめにしわれならなくに,乱れてけさはものをこそ思へ,われても末に逢はむとぞ思ふ,0",//14
"16.下の句は？<br>君がため春の野に出でて若菜摘む,わが身ひとつの秋にはあらねど,わが衣手は露にぬれつつ,わが衣手に雪は降りつつ,2",//15
"17.下の句は？<br>立ち別れいなばの山の峰に生ふる,からくれなゐに水くくるとは,いかに久しきものとかは知る,まつとし聞かば今帰り来む,2",//16
"18.下の句は？<br>ちはやぶる神代も聞かず竜田川,末の松山波越さじとは,からくれなゐに水くくるとは,激しかれとは祈らぬものを,1",//17
"19.下の句は？<br>住の江の岸に寄る波よるさへや,夢の通ひ路人目よくらむ,流れもあへぬ紅葉なりけり,人目も草もかれぬと思へば,0",//18
"20.この句の作者は？<br>瀬をはやみ岩にせかるる滝川のわれても末にあはむとぞ思ふ,大江千里,崇徳院,大江千里,1",
"21.下の句は？<br>難波潟短き蘆のふしの間も,逢はでこの世を過ぐしてよとや,衣干すてふ天の香具山,衣干すてふ天の香具山,0",//19
"22.下の句は？<br>わびぬれば今はたおなじ難波なる,人をも身をも恨みざらまし,みをつくしても逢はむとぞ思ふ,われても末に逢はむとぞ思ふ,1",//20
"23.下の句は？<br>今来むといひしばかりに長月の,人の命の惜しくもあるかな,くだけてものを思ふころかな,有明の月を待ち出でつるかな,2",//21
"24.下の句は？<br>,A1,A2,A3,a",//22
"25.下の句は？<br>,A1,A2,A3,a",//23
"26.下の句は？<br>,A1,A2,A3,a",//24
"27.下の句は？<br>,A1,A2,A3,a",//25
"28.下の句は？<br>,A1,A2,A3,a",//26
"29.下の句は？<br>,A1,A2,A3,a",//27
"30.この句の作者は？<br>忘れじの行く末まではかたければ今日を限りの命ともがな,儀同三司母,山辺赤人,大納言経信,0",
"31.下の句は？<br>,A1,A2,A3,a",//28
"32.下の句は？<br>,A1,A2,A3,a",//29
"33.下の句は？<br>,A1,A2,A3,a",//30
"34.下の句は？<br>,A1,A2,A3,a",//31
"35.下の句は？<br>,A1,A2,A3,a",//32
"36.下の句は？<br>,A1,A2,A3,a",//33
"37.下の句は？<br>,A1,A2,A3,a",//34
"38.下の句は？<br>,A1,A2,A3,a",//35
"39.下の句は？<br>,A1,A2,A3,a",//36
"40.この句の作者は？<br>朝ぼらけ有明の月と見るまでに吉野の里に降れる白雪,前権中納言匡房,能因法師,坂上是則,2",
"41.下の句は？<br>,A1,A2,A3,a",//37
"42.下の句は？<br>,A1,A2,A3,a",//38
"43.下の句は？<br>,A1,A2,A3,a",//39
"44.下の句は？<br>,A1,A2,A3,a",//40
"45.下の句は？<br>,A1,A2,A3,a",//41
"46.下の句は？<br>,A1,A2,A3,a",//42
"47.下の句は？<br>,A1,A2,A3,a",//43
"48.下の句は？<br>,A1,A2,A3,a",//44
"49.下の句は？<br>,A1,A2,A3,a",//45
"50.この句の作者は？<br>天つ風雲の通ひ路吹き閉ぢよをとめの姿しばしとどめむ,法性寺入道前関白太政大臣,僧正遍照,殷富門院大輔,1",
"51.下の句は？<br>,A1,A2,A3,a",//46
"52.下の句は？<br>,A1,A2,A3,a",//47
"53.下の句は？<br>,A1,A2,A3,a",//48
"54.下の句は？<br>,A1,A2,A3,a",//49
"55.下の句は？<br>,A1,A2,A3,a",//50
"56.下の句は？<br>,A1,A2,A3,a",//51
"57.下の句は？<br>,A1,A2,A3,a",//52
"58.下の句は？<br>,A1,A2,A3,a",//53
"59.下の句は？<br>,A1,A2,A3,a",//54
"60.この句の作者は？<br>玉の緒よ絶えなば絶えねながらへば忍ぶることのよわりもぞする,西行法師,式子内親王,藤原清輔朝臣,1",
"61.下の句は？<br>,A1,A2,A3,a",//55
"62.下の句は？<br>,A1,A2,A3,a",//56
"63.下の句は？<br>,A1,A2,A3,a",//57
"64.下の句は？<br>,A1,A2,A3,a",//58
"65.下の句は？<br>,A1,A2,A3,a",//59
"66.下の句は？<br>,A1,A2,A3,a",//60
"67.下の句は？<br>,A1,A2,A3,a",//61
"68.下の句は？<br>,A1,A2,A3,a",//62
"69.下の句は？<br>,A1,A2,A3,a",//63
"70.この句の作者は？<br>いにしへの奈良の都の八重桜けふ九重ににほひぬるかな,伊勢大輔,皇嘉門院別当,権中納言定家,0",
"71.下の句は？<br>,A1,A2,A3,a",//64
"72.下の句は？<br>,A1,A2,A3,a",//65
"73.下の句は？<br>,A1,A2,A3,a",//66
"74.下の句は？<br>,A1,A2,A3,a",//67
"75.下の句は？<br>,A1,A2,A3,a",//68
"76.下の句は？<br>,A1,A2,A3,a",//69
"77.下の句は？<br>,A1,A2,A3,a",//70
"78.下の句は？<br>,A1,A2,A3,a",//71
"79.下の句は？<br>,A1,A2,A3,a",//72
"80.この句の作者は？<br>忘らるる身をば思はず誓ひてし人の命の惜しくもあるかな,参議雅経,殷富門院大輔,右近,2",
"81.下の句は？<br>,A1,A2,A3,a",//73
"82.下の句は？<br>,A1,A2,A3,a",//74
"83.下の句は？<br>,A1,A2,A3,a",//75
"84.下の句は？<br>,A1,A2,A3,a",//76
"85.下の句は？<br>,A1,A2,A3,a",//77
"86.下の句は？<br>,A1,A2,A3,a",//78
"87.下の句は？<br>,A1,A2,A3,a",//79
"88.下の句は？<br>,A1,A2,A3,a",//80
"89.下の句は？<br>,A1,A2,A3,a",//81
"90.この句の作者は？<br>君がため惜しからざりし命さへ長くもがなと思ひけるかな,従二位家隆,殷富門院大輔,藤原義孝,2",
"91.下の句は？<br>,A1,A2,A3,a",//82
"92.下の句は？<br>,A1,A2,A3,a",//83
"93.下の句は？<br>,A1,A2,A3,a",//84
"94.下の句は？<br>,A1,A2,A3,a",//85
"95.下の句は？<br>,A1,A2,A3,a",//86
"96.下の句は？<br>,A1,A2,A3,a",//87
"97.下の句は？<br>,A1,A2,A3,a",//88
"98.下の句は？<br>,A1,A2,A3,a",//89
"99.下の句は？<br>,A1,A2,A3,a",//90
"100.この句の作者は？<br>人はいさ心も知らずふるさとは花ぞ昔の香ににほひける,周防内侍,祐子内親王家紀伊,紀貫之,2",
"101.下の句は？<br>,A1,A2,A3,a",//91
"102.下の句は？<br>,A1,A2,A3,a",//92
"103.下の句は？<br>,A1,A2,A3,a",//93
"104.下の句は？<br>,A1,A2,A3,a",//94
"105.下の句は？<br>,A1,A2,A3,a",//95
"106.下の句は？<br>,A1,A2,A3,a",//96
"107.下の句は？<br>,A1,A2,A3,a",//97
"108.下の句は？<br>,A1,A2,A3,a",//98
"109.下の句は？<br>,A1,A2,A3,a",//99
"110.下の句は？<br>,A1,A2,A3,a",//100
"111.この句の作者は？<br>花の色は移りにけりないたづらにわが身世にふるながめせしまに,小野小町,菅家,源宗于朝臣,1",
];

//メインプログラム
window.onload = function() {
    //Gameオブジェクトの生成
    var game = new Game(320, 320);
    game.rootScene.backgroundColor = "#CC2600";
    
    //オブジェクト
    var qIndex = 0;
    var qLabel;
    var aButton = new Array(4);
    var aTag;
    
    //画像の読み込み
    game.preload("window.png", "goukaku.png", "fugoukaku.png");
    
    //ボタンの追加
    function addButton(tag,text, x, y) {
        var button = new Button(text, "light");
        button.tag = tag;
        button.font = "20px monospace";
        button.moveTo(x, y);
        button.ontouchend = function() {
            if (this.tag == aTag){ scoreLabel.score +=10;}
            nextQuestion();
        }
        return button;
    }
    
    //次の質問
    function nextQuestion() {
        if (qIndex<111) {
            var data=Q[qIndex].split(",");
            qLabel.text = data[0];
            aButton[0].text = data[1];
            aButton[1].text = data[2];
            aButton[2].text = data[3];
            aTag = data[4];
            qIndex++;
        } else {
            result();
        }
    }
    
    //結果
    function result() {
        //シーンの生成
        var scene = new Scene();
        scene.backgroundColor = "rgb(255, 255, 255)";
        
        //合格・不合格の生成
        var hanko = new Sprite();
        if (scoreLabel.score >= 80) {
            hanko.image = game.assets["goukaku.png"];
        } else {
            hanko.image = game.assets["fugoukaku.png"];
        }
        hanko.moveTo(74, 15);
        hanko.width = 172;
        hanko.height = 172;
        scene.addChild(hanko);
        
        //正解率の生成
        var label = new Label();
        label.text="正解率" + scoreLabel.score + "%";
        label.font = "bold 24px monospace";
        label.y=240;
        label.width = 320;
        label.textAlign = "center";
        scene.addChild(label);
        game.pushScene(scene);
    }    
    
    //ロード完了時の処理
    game.onload = function(){
        //ウィンドウの生成
        var window = new Sprite();
        window.image = game.assets["window.png"];
        window.moveTo(15, 70);
        window.width = 290;
        window.height = 120;
        game.rootScene.addChild(window);
        
        //質問ラベルの生成
        qLabel = new Label();
        qLabel.color = "rgb(255, 255, 255)";
        qLabel.font = "24px monospace";
        qLabel.moveTo(25, 87);
        qLabel.width = 260;
        game.rootScene.addChild(qLabel);
        
        //解答ボタンの生成
        for (var i=0; i<3; i++) {
            aButton[i] = addButton(""+i,"", 20, 200+40*i);     
            aButton[i].width = 260;
            aButton[i].height = 30;
            game.rootScene.addChild(aButton[i]);
        }
        //スコアラベル
        scoreLabel = new ScoreLabel(5, 5);
        scoreLabel.score = 0;
        game.rootScene.addChild(scoreLabel);
        //次の質問
        nextQuestion();
    }
        
    //ゲーム開始
    game.start();
}